{
  "users": [
    {
      "id": "001",
      "login": "Inna",
      "password": "12345Aa",
      "registred_at": "2024-11-11",
      "role_id": "0"
    },
    {
      "id": "002",
      "login": "user",
      "password": "qwerty",
      "registred_at": "2024-11-11",
      "role_id": "0"
    },
    {
      "id": "4823",
      "login": "login",
      "password": "password",
      "registred_at": "2059-07-27 07:25",
      "role_id": "1"
    },
    {
      "id": "dcb5",
      "login": "admin",
      "password": "admin1",
      "registred_at": "2034-12-30 20:01",
      "role_id": "1"
    },
    {
      "id": "0327",
      "login": "userNEW",
      "password": "qwerty",
      "registred_at": "2036-08-18 19:34",
      "role_id": "1"
    }
  ],
  "roles": [
    {
      "id": "0",
      "name": "Admin"
    },
    {
      "id": "1",
      "name": "Guest"
    },
    {
      "id": "2",
      "name": "Viewer"
    }
  ],
  "rooms": [
    {
      "id": "001",
      "title": "А-frame 2-х местный",
      "img_url": "https://i.pinimg.com/736x/ee/d8/5f/eed85feb9ca4fb2c05c82d76b8cdb1e3.jpg",
      "content": "Шикарный дом в стиле А-frаmе – это настоящий «рай в шалаше», который прекрасно подойдет для романтического отдыха.Внутреннее пространство дома имеет два уровня. На первом располагается уютная гостиная с большим диваном и подвесным креслом-качелями, полноценной кухней, обеденной зоной и санузлом. На втором уровне – уютная спальная зона с большой кроватью.В любое время года здесь комфортная температура и всегда есть горячая вода. Зимой включается теплый пол, имеется обогреватель. Для защиты от летнего зноя можно использовать кондиционер и вентилятор. На территории дома работает скоростной WiFi. В гостиной установлен большой телевизор со множеством телеканалов. Для верхней одежды и вещей в доме есть вешалки и платяной шкаф. Для хранения ценных вещей, вы можете воспользоваться сейфом.",
      "max_capacity": "2",
      "price": "5.000"
    },
    {
      "id": "002",
      "title": "А-frame 4-х местный",
      "img_url": "https://i.pinimg.com/736x/b5/0a/69/b50a6963b34d54ad56aebb17594188a1.jpg",
      "content": "Приватный экодом в стиле Афрейм с расширенной террасой, домашним 4К кинотеатром и панорамным видом на сказочный лес. Это современные, наполненные тонким древесным ароматом Афрейм дома, с панорамным видом на первозданный лес, в которых созданы все привычные городскому жителю условия. На открытых террасах так приятно созерцать звезды и мечтать...Для тех, кому нужно больше, на территории есть SPA зона, летний кинотеатр с качелями и костровой зоной, велосипеды, лыжи, все для игр на природе, доступ к водохранилищу и деревенским пляжам, а также в 20 минутах езды Оленья ферма.Хотите отдохнуть в нашем отеле? Проверьте, есть ли свободный номер на нужные вам даты!",
      "max_capacity": "4",
      "price": "10.000"
    },
    {
      "id": "003",
      "title": "2-х этажный дом",
      "img_url": "https://cdn.worldota.net/t/1024x768/extranet/b9/c5/b9c5173938e72f2f79c2afe4c2727ba079f0fd93.jpeg",
      "content": "Отдельная изба из натурального дерева с террасой, площадкой для отдыха и настоящим самоваром, для ценителей русской культуры. Двухэтажный дом  — это идеальное место для комфортного отдыха в кругу семьи или друзей. Он рассчитан на 10 человек и предлагает четыре уютные спальни, просторную гостиную с мягкой мебелью и обеденной зоной, а также полностью оборудованную кухню. На территории базы есть всё необходимое для отличного времяпрепровождения: зоны для пикника, спортивные площадки и детские игровые зоны.На заднем дворе нашего отеля расположен бассейн для детей. Он неглубокий и безопасный, поэтому малыши смогут плескаться в своё удовольствие. Наши сотрудники тщательно следят за чистотой воды и территории вокруг бассейна.",
      "max_capacity": "10",
      "price": "20.000"
    },
    {
      "id": "004",
      "title": "А-frame для влюбленных",
      "img_url": "https://s0.rbk.ru/v6_top_pics/media/img/7/01/346916767245017.jpeg",
      "content": "Приглашаем вас остановиться в уютном номере, созданном специально для влюблённых пар. Здесь вы сможете насладиться романтикой и красотой природы Алтая. Номер оснащён удобной кроватью с ортопедическим матрасом, мягкой мебелью и рабочей зоной. Также имеется собственная ванная комната с душем и косметическими принадлежностями. Из окон открывается вид на горы или лес. В вашем распоряжении будут все услуги отеля: спа-центр, ресторан, бесплатный Wi-Fi и многое другое. Уединение на базе отдыха имеет множество плюсов. Вы сможете отдохнуть от городской суеты и шума, насладиться природой и свежим воздухом. Также уединение поможет вам расслабиться и восстановить силы, посвятить время себе и провести его с близким человеком в спокойной обстановке.",
      "max_capacity": "2",
      "price": "5000"
    },
    {
      "id": "005",
      "title": "Номер стандарт",
      "img_url": "https://avatars.mds.yandex.net/get-altay/1063709/2a000001661fc234d2576e7a3371beedfc7c/XXXL",
      "content": "Номер с двуспальной кроватью в главном корпусе отеля на Алтае — это идеальный выбор для тех, кто хочет насладиться комфортом и живописной природой. Удобное расположение обеспечивает лёгкий доступ ко всем удобствам и услугам отеля, а профессиональный персонал всегда готов помочь вам. Номера отличаются стильным дизайном и оснащены современными удобствами, создавая идеальные условия для отдыха и релаксации.",
      "max_capacity": "2",
      "price": "3.500"
    },
    {
      "id": "006",
      "title": "Номер стандарт",
      "img_url": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/214766479.jpg?k=7cd2af7f9209c4572a5797a23c161258930f0151f8c316ab4e15209610046bbe&o=&hp=1",
      "content": "Номер с двуспальной кроватью в главном корпусе отеля на Алтае — это идеальный выбор для тех, кто хочет насладиться комфортом и живописной природой. Удобное расположение обеспечивает лёгкий доступ ко всем удобствам и услугам отеля, а профессиональный персонал всегда готов помочь вам. Номера отличаются стильным дизайном и оснащены современными удобствами, создавая идеальные условия для отдыха и релаксации.В нашем отеле есть специальная комната для детских игр. Здесь ваши дети смогут весело и интересно провести время, пока вы отдыхаете или занимаетесь своими делами. Комната оснащена яркими и безопасными игрушками, книгами и развивающими материалами. Наши внимательные сотрудники присмотрят за вашими малышами и позаботятся об их комфорте.",
      "max_capacity": "2",
      "price": "3.500"
    },
    {
      "id": "007",
      "title": "Номер эконом",
      "img_url": "https://www.izmailovo.ru/upload/iblock/fc2/fc2dad1b6e4eb0d18b8b17de1d4e16f1.jpg",
      "content": "Номер с двумя односпальными кроватями в главном корпусе отеля на Алтае — это прекрасный выбор для семьи с детьми, компании друзей или коллег. Он сочетает в себе комфорт, уют и живописные виды природы. Удобное расположение обеспечивает лёгкий доступ ко всем удобствам и услугам отеля, а профессиональный персонал всегда готов помочь вам. Номера оснащены современными удобствами, создавая идеальные условия для отдыха и релаксации. В нашем отеле есть специальная комната для детских игр. Здесь ваши дети смогут весело и интересно провести время, пока вы отдыхаете или занимаетесь своими делами. Комната оснащена яркими и безопасными игрушками, книгами и развивающими материалами. Наши внимательные сотрудники присмотрят за вашими малышами и позаботятся об их комфорте.",
      "max_capacity": "2",
      "price": "2.500"
    },
    {
      "id": "008",
      "title": "Дом класса люкс",
      "img_url": "https://s.101hotelscdn.ru/uploads/image/hotel_image/161023/1465254.jpg",
      "content": "Дом класса люкс на Алтае — это идеальное место для тех, кто ищет уединение и комфорт среди живописной природы. Он расположен в одном из самых красивых мест региона, вдали от городской суеты. В доме есть всё необходимое для роскошного отдыха: просторные комнаты с панорамными окнами, современная техника и удобная мебель. С террас открывается потрясающий вид на горы и леса Алтая. А внимательный персонал сделает всё возможное, чтобы ваше пребывание было приятным и запоминающимся. В нашем отеле есть специальная комната для детских игр. Здесь ваши дети смогут весело и интересно провести время, пока вы отдыхаете или занимаетесь своими делами. Комната оснащена яркими и безопасными игрушками, книгами и развивающими материалами. Наши внимательные сотрудники присмотрят за вашими малышами и позаботятся об их комфорте.",
      "max_capacity": "5",
      "price": "15.000"
    }
  ],
  "bookings": [
    {
      "id": "3a49",
      "title": "А-frame 2-х местный",
      "room_id": "001",
      "user_id": "001",
      "user_login": "Inna",
      "date": [
        "2025-01-21",
        "2025-01-22",
        "2025-01-23",
        "2025-01-24",
        "2025-01-25"
      ],
      "status": "2"
    },
    {
      "id": "ae88",
      "title": "А-frame 2-х местный",
      "room_id": "001",
      "user_id": "001",
      "user_login": "Inna",
      "date": [
        "2025-02-04",
        "2025-02-05",
        "2025-02-06",
        "2025-02-07"
      ],
      "status": "0"
    },
    {
      "id": "5fc2",
      "title": "А-frame 2-х местный",
      "room_id": "001",
      "user_id": "002",
      "user_login": "user",
      "date": [
        "2025-03-11",
        "2025-03-12",
        "2025-03-13",
        "2025-03-14",
        "2025-03-15",
        "2025-03-16"
      ],
      "status": "0"
    },
    {
      "id": "2f54",
      "title": "Дом класса люкс",
      "room_id": "008",
      "user_id": "002",
      "user_login": "user",
      "date": [
        "2025-01-09",
        "2025-01-10",
        "2025-01-11",
        "2025-01-12"
      ],
      "status": "1"
    },
    {
      "id": "8566",
      "title": "А-frame 2-х местный",
      "room_id": "001",
      "user_id": "002",
      "user_login": "user",
      "date": [
        "2025-01-29",
        "2025-01-30",
        "2025-01-31",
        "2025-02-01"
      ],
      "status": "0"
    },
    {
      "id": "463a",
      "title": "2-х этажный дом",
      "room_id": "003",
      "user_id": "002",
      "user_login": "user",
      "date": [
        "2025-01-16",
        "2025-01-17",
        "2025-01-18"
      ],
      "status": "0"
    },
    {
      "id": "ff9a",
      "title": "Дом класса люкс",
      "room_id": "008",
      "user_id": "002",
      "user_login": "user",
      "date": [
        "2025-02-13",
        "2025-02-14",
        "2025-02-15"
      ],
      "status": "0"
    }
  ],
  "statuses": [
    {
      "id": "0",
      "name": "Ожидает подтверждения"
    },
    {
      "id": "1",
      "name": "Подтверждено"
    },
    {
      "id": "2",
      "name": "Отменено"
    }
  ],
  "sessions": [
    {
      "id": "9b15",
      "hash": "0.51546943230274000491419883474009111523628234863281",
      "user": {
        "id": "002",
        "login": "user",
        "password": "qwerty",
        "registredAt": "2024-11-11",
        "roleId": "0"
      }
    },
    {
      "id": "1574",
      "hash": "0.75739393730118420577923643577378243207931518554688",
      "user": {
        "id": "002",
        "login": "user",
        "password": "qwerty",
        "registredAt": "2024-11-11",
        "roleId": "0"
      }
    },
    {
      "id": "68e2",
      "hash": "0.87926962810127218261868620174936950206756591796875",
      "user": {
        "id": "002",
        "login": "user",
        "password": "qwerty",
        "registredAt": "2024-11-11",
        "roleId": "0"
      }
    },
    {
      "id": "a912",
      "hash": "0.59679350149181331630643398966640233993530273437500",
      "user": {
        "id": "001",
        "login": "Inna",
        "password": "12345Aa",
        "registredAt": "2024-11-11",
        "roleId": "0"
      }
    },
    {
      "id": "517c",
      "hash": "0.72816679919636007056737980747129768133163452148438",
      "user": {
        "id": "002",
        "login": "user",
        "password": "qwerty",
        "registredAt": "2024-11-11",
        "roleId": "0"
      }
    }
  ]
}